In [2]:
# 6388040 Ariya Phengphon
# Section 2
# Week 7 : Pandas

In [3]:
# EXAMPLE 1 - Homogeneous Data (Same Data type)
import pandas as pd
import numpy as np
# Series => creates one-dimensional data structure
# Generates the list of an array
data = np.array(['a', 'b', 'c', 'd'])
# Make one-dimensional array with axis labels
s1 = pd.Series(data)
print("s1:")
print(s1)

data = np.array([1, 2, 3, 4])
s2 = pd.Series(data)
print("s2:")
print(s2)

# s1 represents the one-dimensional array that's a 'character'
# s2 represents the one-dimensional array that's an 'integer'

# Heterogeneous Data (Different Data type)
data = np.array([1, 'b', 3, 'd'])
s3 = pd.Series(data)
print("s3:")
print(s3)

data = np.array(['a', 'b', 'c', 'd'])
s = pd.Series(data, index=[100, 101, 102, 103])
print("s:")
print(s)

# Yes, index goes first, the followed by data

s1:
0    a
1    b
2    c
3    d
dtype: object
s2:
0    1
1    2
2    3
3    4
dtype: int32
s3:
0    1
1    b
2    3
3    d
dtype: object
s:
100    a
101    b
102    c
103    d
dtype: object

In [4]:
s = pd.Series([1, 2, 3, 4, 5], index = ['a', 'b', 'c', 'd', 'e'])
print(s[0]) # 1st (y position)
print(s[1]) # 2nd
print(s[2]) # 3rd
print(s[['a']]) # access the data the is on the same index as this (a, 1)
print(s[['e']]) # (e, 5)
# if [] then it will get only the data that has the same index as this (a, '1'), 1
# if [[]] then it will get both this and the matched index

# Retrieved multiple elements
print(s[['a', 'c', 'd']])

1
2
3
a    1
dtype: int64
e    5
dtype: int64
a    1
c    3
d    4
dtype: int64

In [5]:
import pandas as pd
# DataFrame => creates two-dimensional data structure
# Generates roll and column
df = pd.DataFrame()
print(df)
data = [1, 2, 3, 4, 5]
df1 = pd.DataFrame(data)
# Left is index, right is your data
print(df1)

data = [['Alex', 10],['Bob', 12],['Clarke', 13]]
df2 = pd.DataFrame(data, columns=['Name', 'Age'])
print(df2)
print(type(data))

Empty DataFrame
Columns: []
Index: []
   0
0  1
1  2
2  3
3  4
4  5
     Name  Age
0    Alex   10
1     Bob   12
2  Clarke   13
<class 'list'>

In [6]:
# Create a DataFrame from Dift of ndarrays/ Lists
data = {'Name' : ['Tom', 'Jack', 'Steve', 'Ricky'],
        'Age' : [28,34,29,42]}
df = pd.DataFrame(data)
print(df)
print(type(data))

    Name  Age
0    Tom   28
1   Jack   34
2  Steve   29
3  Ricky   42
<class 'dict'>

In [7]:
# Create a DataFrame from Dict of Series
d = {'one' : pd.Series([1, 2, 3], index=['a', 'b', 'c']),
     'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])
}
df = pd.DataFrame(d)
print(df)

# We have NaN because they are no value that has the same index
# as we input like NaN on 'd', but on 'one', it doesn't have 'd' in index.

   one  two
a  1.0    1
b  2.0    2
c  3.0    3
d  NaN    4

In [8]:
# Create Table 1 : studentDF DataFrame
data = {'Math' : pd.Series([90, 10, 34, 23, 43], index=[0, 1, 2, 3, 4]),
'C-Programming' : pd.Series([70, 20, 25, 32, 73], index=[0, 1, 2, 3, 4]),
'Java' : pd.Series([50, 41, 67, 34, 23], index=[0, 1, 2, 3, 4]),
'Web-Programming' : pd.Series([55, 66, 23, 76, 67], index=[0, 1, 2, 3, 4])
}

# data = [[90, 70, 50, 55], [10, 20, 41, 66], [34, 25, 67, 23]]
# data = pd.DataFrame(data, columns=['Math', 'CProg', 'Java', 'WebProg'])

studentDF = pd.DataFrame(data)
print(studentDF)

   Math  C-Programming  Java  Web-Programming
0    90             70    50               55
1    10             20    41               66
2    34             25    67               23
3    23             32    34               76
4    43             73    23               67

In [9]:
# Row Selection, Addition, and Deletion
df = studentDF # Replace old table (Above)
print(df)
print(df[2:4])  # Get from index 2 - (4-1) # Slice Rows
print(df.loc[0]) # Get rows 0 #.loc[] is primarily label based, but may also be used with a boolean array.
print(df.loc[2]) # Get rows 2
print(df.loc[0:2]) # Get column 0 - 2

   Math  C-Programming  Java  Web-Programming
0    90             70    50               55
1    10             20    41               66
2    34             25    67               23
3    23             32    34               76
4    43             73    23               67
   Math  C-Programming  Java  Web-Programming
2    34             25    67               23
3    23             32    34               76
Math               90
C-Programming      70
Java               50
Web-Programming    55
Name: 0, dtype: int64
Math               34
C-Programming      25
Java               67
Web-Programming    23
Name: 2, dtype: int64
   Math  C-Programming  Java  Web-Programming
0    90             70    50               55
1    10             20    41               66
2    34             25    67               23

In [10]:
df = pd.DataFrame([[1, 2], [3, 4]], columns = ['a', 'b'])
df2 = pd.DataFrame([[5, 6], [7, 8]], columns = ['a','b'])
df = df.append(df2) # Append df2 to df
print(df)

   a  b
0  1  2
1  3  4
0  5  6
1  7  8

In [11]:
# Table 2 : New rows of studentDF
#studentDF2 = pd.DataFrame([[59, 37], [41, 34]], columns = ['Math', 'C-programming'])
#studentDF.append(studentDF2)

studentDF2 = {'Math' : pd.Series([59, 41], index=[5, 6]),
'C-Programming' : pd.Series([37, 34], index=[5, 6]),
'Java' : pd.Series([84, 73], index=[5, 6]),
'Web-Programming' : pd.Series([82, 55], index=[5, 6])
}
df = pd.DataFrame(studentDF2)
ans = studentDF.append(df)
print(ans)

   Math  C-Programming  Java  Web-Programming
0    90             70    50               55
1    10             20    41               66
2    34             25    67               23
3    23             32    34               76
4    43             73    23               67
5    59             37    84               82
6    41             34    73               55

In [12]:
# Delete rows
df = ans
print("Before:")
print(df)
df = df.drop(0)  # Delete rows 0
df = df.drop(6)
print("After:")
print(df)

Before:
   Math  C-Programming  Java  Web-Programming
0    90             70    50               55
1    10             20    41               66
2    34             25    67               23
3    23             32    34               76
4    43             73    23               67
5    59             37    84               82
6    41             34    73               55
After:
   Math  C-Programming  Java  Web-Programming
1    10             20    41               66
2    34             25    67               23
3    23             32    34               76
4    43             73    23               67
5    59             37    84               82

### ------ **Milestone 1 completed** ------

In [13]:
# Decriptive Statistics
data = {'Name' : ['Tom', 'Jack', 'Steve', 'Ricky'],
        'Age' : [28, 34, 29, 42]}
df = pd.DataFrame(data)
df2 = df
df.sum()

# # Set the index
# df.sum = df.sum()
# # Return the axes labels of the dataframe
# result = df.axes
# # Print the result
# print(result)

Name    TomJackSteveRicky
Age                   133
dtype: object

In [24]:
# Use statistic function
data = {'Name' : ['Tom', 'Jack', 'Steve', 'Ricky'],
'Age' : [28, 34, 29, 42]}
df = pd.DataFrame(data)
df.count()
df.sum()
df.mean()
df.median()
df.mode()
df.std()
df.min()
df.max()
df.sum().abs       # Can use abs only integer/float not string
df.prod()          # Product of Values
df.cumsum()        # Cumulative Sum, sum all integer, float, string(concatenate)
df.sum().cumprod() # Cumulative Sum
df.describe()      # Compute a summary of statistics

             Age
count   4.000000
mean   33.250000
std     6.396614
min    28.000000
25%    28.750000
50%    31.500000
75%    36.000000
max    42.000000

In [15]:
import pandas as pd
import numpy as np
#Create a Dictionary of series
d = {'Name' : pd.Series(['Tom', 'James', 'Ricky', 'Vin', 'Steve', 'Smith',
                        'Jack', 'Lee', 'David', 'Gasper', 'Betina', 'Andres']),
     'Age' : pd.Series([25, 26, 25, 23, 30, 29, 23, 34, 40, 30, 51, 46]),
    'Rating' : pd.Series([4.23, 3.24, 3.98, 2.56, 3.20, 4.6, 3.8, 3.78, 2.98, 4.80, 4.10, 3.65])
}

#Create a DataFrame
df = pd.DataFrame(d)
df.describe()

             Age     Rating
count  12.000000  12.000000
mean   31.833333   3.743333
std     9.232682   0.661628
min    23.000000   2.560000
25%    25.000000   3.230000
50%    29.500000   3.790000
75%    35.500000   4.132500
max    51.000000   4.800000

In [16]:
studentDF2 = {'Math' : pd.Series([59, 41], index=[5, 6]),
'C-Programming' : pd.Series([37, 34], index=[5, 6]),
'Java' : pd.Series([84, 73], index=[5, 6]),
'Web-Programming' : pd.Series([82, 55], index=[5, 6])
}
df = pd.DataFrame(studentDF2)
ans = studentDF.append(df)
print(ans)
ans.describe()

   Math  C-Programming  Java  Web-Programming
0    90             70    50               55
1    10             20    41               66
2    34             25    67               23
3    23             32    34               76
4    43             73    23               67
5    59             37    84               82
6    41             34    73               55

            Math  C-Programming       Java  Web-Programming
count   7.000000       7.000000   7.000000         7.000000
mean   42.857143      41.571429  53.142857        60.571429
std    25.944997      21.235639  22.251806        19.329228
min    10.000000      20.000000  23.000000        23.000000
25%    28.500000      28.500000  37.500000        55.000000
50%    41.000000      34.000000  50.000000        66.000000
75%    51.000000      53.500000  70.000000        71.500000
max    90.000000      73.000000  84.000000        82.000000

In [17]:
# Missing Data
studentDF = studentDF.reindex([0,1,2,3,4,5,6,7])
print(studentDF)
# N of NaN = 12

   Math  C-Programming  Java  Web-Programming
0  90.0           70.0  50.0             55.0
1  10.0           20.0  41.0             66.0
2  34.0           25.0  67.0             23.0
3  23.0           32.0  34.0             76.0
4  43.0           73.0  23.0             67.0
5   NaN            NaN   NaN              NaN
6   NaN            NaN   NaN              NaN
7   NaN            NaN   NaN              NaN

In [18]:
# Check for Missing Values
df = pd.DataFrame(np.random.randn(5, 3),
    index=['a', 'c', 'e','f', 'h'],
    columns=['one', 'two', 'three'])
df = df.reindex(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h'])
# print(df)
print(df['one'].isnull())
print(df['two'].notnull())

a    False
b     True
c    False
d     True
e    False
f    False
g     True
h    False
Name: one, dtype: bool
a     True
b    False
c     True
d    False
e     True
f     True
g    False
h     True
Name: two, dtype: bool

In [19]:
# Filling Missing Data by using fillna
s1 = studentDF
s2 = studentDF
s1 = s1.fillna(0)
s2 = s2.fillna(method='pad') # Repeting the recent value on the null data
print(s1)
print(s2)

   Math  C-Programming  Java  Web-Programming
0  90.0           70.0  50.0             55.0
1  10.0           20.0  41.0             66.0
2  34.0           25.0  67.0             23.0
3  23.0           32.0  34.0             76.0
4  43.0           73.0  23.0             67.0
5   0.0            0.0   0.0              0.0
6   0.0            0.0   0.0              0.0
7   0.0            0.0   0.0              0.0
   Math  C-Programming  Java  Web-Programming
0  90.0           70.0  50.0             55.0
1  10.0           20.0  41.0             66.0
2  34.0           25.0  67.0             23.0
3  23.0           32.0  34.0             76.0
4  43.0           73.0  23.0             67.0
5  43.0           73.0  23.0             67.0
6  43.0           73.0  23.0             67.0
7  43.0           73.0  23.0             67.0

### ------ **Milestone 2 completed** ------

In [20]:
# Joining / Grouping
left = pd.DataFrame({
'id' : [1, 2, 3, 4, 5],
'Name' : ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'],
'subject_id' : ['sub1', 'sub2', 'sub4', 'sub6', 'sub5']
})

right = pd.DataFrame({
'id' : [1, 2 ,3, 4, 5],
'subject_name' : ['Math','English', 'Social Science', 'Programming', 'Physics']
})

print(left)
print(right)

# Merge
# It has duplicated id that can be reduced
merged_table = pd.merge(left,right,on='id')
print(merged_table)

   id    Name subject_id
0   1    Alex       sub1
1   2     Amy       sub2
2   3   Allen       sub4
3   4   Alice       sub6
4   5  Ayoung       sub5
   id    subject_name
0   1            Math
1   2         English
2   3  Social Science
3   4     Programming
4   5         Physics
   id    Name subject_id    subject_name
0   1    Alex       sub1            Math
1   2     Amy       sub2         English
2   3   Allen       sub4  Social Science
3   4   Alice       sub6     Programming
4   5  Ayoung       sub5         Physics

In [21]:
# Create table section and create table student, and use merge()
left = pd.DataFrame({
'id' : [0, 1, 2, 3, 4, 5],
'section' : ['one', 'one', 'one', 'two', 'two', 'two'],
})

right = pd.DataFrame({
'id' : [0, 1, 2, 3, 4, 5],
'name' : ['Mat','Mike', 'John', 'Preecha', 'Prabu', 'Bunchu'],
'math' : [34, 12, 34, 12, 65, 23],
'english' : [23, 13, 51, 62, 12, 42]
})

print(left)
print(right)

merged_table = pd.merge(left,right,on='id')
print(merged_table)

# A groupby operation involves some combination of splitting the object, 
# applying a function, and combining the results.
# Sum of data based on grouped by 'section'
score_sec = merged_table.groupby('section')
score_sec.sum()

   id section
0   0     one
1   1     one
2   2     one
3   3     two
4   4     two
5   5     two
   id     name  math  english
0   0      Mat    34       23
1   1     Mike    12       13
2   2     John    34       51
3   3  Preecha    12       62
4   4    Prabu    65       12
5   5   Bunchu    23       42
   id section     name  math  english
0   0     one      Mat    34       23
1   1     one     Mike    12       13
2   2     one     John    34       51
3   3     two  Preecha    12       62
4   4     two    Prabu    65       12
5   5     two   Bunchu    23       42

         id  math  english
section
one       3    80       87
two      12   100      116

### ------ **Milestone 3 completed** ------